In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [['Dinda',7],['Davis',8],['Iffa',5]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

    Nama  Usia
0  Dinda     7
1  Davis     8
2   Iffa     5

In [3]:
df2["Nama"]

0    Dinda
1    Davis
2     Iffa
Name: Nama, dtype: object

In [4]:
df2["Usia"]

0    7
1    8
2    5
Name: Usia, dtype: int64

In [5]:
df2["Nama"][0]

'Dinda'

In [6]:
df2.iloc[0][0]

'Dinda'

In [7]:
df2.loc[0]["Nama"]

'Dinda'

In [8]:
df2.at[0,"Nama"]

'Dinda'

In [9]:
df2.iat[0,0]

'Dinda'

In [10]:
df2.iloc[0]

Nama    Dinda
Usia        7
Name: 0, dtype: object

In [11]:
df2.loc[:,'Nama']

0    Dinda
1    Davis
2     Iffa
Name: Nama, dtype: object

In [13]:
df3 = pd.DataFrame([['Dinda',7],['Davis',8],['Iffa',5]],columns=['Nama','Usia'])
df3

    Nama  Usia
0  Dinda     7
1  Davis     8
2   Iffa     5

In [14]:
df3.set_index("Nama")

       Usia
Nama
Dinda     7
Davis     8
Iffa      5

In [15]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [16]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [17]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

In [19]:
df5 = pd.DataFrame([['Dinda',7],['Davis',8],['Iffa',5]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

    Nama  Usia  Index
0  Dinda     7      0
1  Davis     8      1
2   Iffa     5      2

In [21]:
df5 = pd.DataFrame([['Dinda',7],['Davis',8],['Iffa',5]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5.loc[:, "Gender"] = pd.Series(['P','P','P'])
df5

    Nama  Usia  Index Gender
0  Dinda     7      0      P
1  Davis     8      1      P
2   Iffa     5      2      P

In [22]:
len(df2)

3

In [23]:
len(df2["Nama"])

3

In [24]:
print(df2.shape)

(3, 2)

In [25]:
df6 = pd.DataFrame([['Dinda',7],['Davis',8],['Iffa',5]],columns=['Nama','Usia'])
df6

    Nama  Usia
0  Dinda     7
1  Davis     8
2   Iffa     5

In [26]:
del df6['Nama']
df6

   Usia
0     7
1     8
2     5

In [27]:
df6=df6[2:]
df6

   Usia
2     5

In [28]:
df6 = pd.DataFrame([['Dinda',7],['Davis',8],['Iffa',5]],columns=['Nama','Usia'])
df6

    Nama  Usia
0  Dinda     7
1  Davis     8
2   Iffa     5

In [30]:
df6=df6.drop(df6.index[[0,2]])
df6

    Nama  Usia
1  Davis     8